---
kind: property
id: P:Autodesk.Revit.DB.ScheduleDefinition.AreaSchemeId
source: html/9f7b2f19-1b20-fa58-72b8-0331bd8bb7bc.htm
---
# Autodesk.Revit.DB.ScheduleDefinition.AreaSchemeId Property

In an area schedule, the ID of the area scheme to display.

## Syntax (C#)
```csharp
public ElementId AreaSchemeId { get; }
```

## Remarks
Schedules of the Areas category show area elements belonging to a single
 area scheme. Key schedules of the Areas category apply to all area schemes, so they
 don't have an area scheme ID.